app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @post.usuario_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "extension", "titulo", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 03 Jan 2013 10:02:05 UTC +00:00], ["extension", "jpg"], ["titulo", "Post 1 de Sara"], ["updated_at", Thu, 03 Jan 2013 10:02:05 UTC +00:00], ["usuario_id", 1]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "titulo" = 'Post 4 de Sara editado por Pepita (¡¡¡FALLO!!!)', "updated_at" = '2013-01-03 10:15:30.476722' WHERE "posts"."id" = 4

  def mis_posts
    @posts = Post.where(:usuario_id => current_user)
---
SELECT "posts".* FROM "posts" WHERE "posts"."usuario_id" = 1