app/controllers/usuarios_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @usuario = Usuario.new(params[:usuario])
    datos = params[:usuario].to_hash

    if @usuario.save
---
INSERT INTO "usuarios" ("admin", "created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "usuarios" SET "salt" = 'KaC4mtnx7uGnamYRsL8p', "crypted_password" = '$2a$10$1AYxH3laqwyvvJnOnCCs1OQBSk7pB3NgkJ1DDcyzffJmvlP1TzZMS', "updated_at" = '2013-01-03 10:16:49.947267' WHERE "usuarios"."id" = 2